// UTF-8
// Карта аналогичных по внешнему виду символов
const alph = {
    '1': ['𝟣'],
    'а': ['a'],
    'в': ['ʙ'],
    'е': ['e'],
    'з': ['ɜ'],
    'и': ['ᴎ'],
    'к': ['κ'],
    'о': ['o', 'ο'],
    'п': ['п'],
    'р': ['p'],
    'с': ['c', 'ϲ'],
    'у': ['y'],
    'х': ['x'],
    'я': ['ᴙ'],

    'А': ['A', 'Α'],
    'В': ['B', 'Β', '𝖡'],
    'Г': ['Γ', 'ᒥ'],
    'Е': ['E', 'Ε'],
    'И': ['Ͷ'],
    'К': ['K', 'Κ'],
    'М': ['M', 'Μ'],
    'Н': ['H', 'Η'],
    'О': ['O', 'Ο'],
    'П': ['Π'],
    'Р': ['P', 'Ρ'],
    'С': ['C', 'Ϲ'],
    'Т': ['T', 'Τ'],
    'Х': ['X', 'Χ'],
};

// Временный элемент для преобразования &...; символов в UTF-8
let tmp = document.createElement('div');

export default function mask(str: string) {
    // Преобразование последовательностей типа &...; в символ
    tmp.innerHTML = str;
    str = tmp.innerHTML;

    // Замена символов на похожие
    return str.split('').map(s => {
        const repl = alph[s];

        // Нет замены пропускаем
        if (!repl) return s;

        // Замена только одна - берем ее
        if (repl.length === 1) return repl[0];

        // Замен несколько - выбираем случайную
        return repl[Math.floor(Math.random() * repl.length)];
    }).join(String.fromCharCode(8204)); // Соединить символы с разделителем "символ нулевой ширины"
}
